{
    "title":"The Goddesses Are Gone",
    "content": [
        { "type": "header", "value": "Introduction" },
        { "type": "text",   "value": "The Goddesses are Gone is a tiny, solo, scoring-oriented strategy game made with Unity."},
        { "type": "text",   "value": "In this game you'll build a city in vast, strange caves, before the ichor tide rises and once again destroys everything. In this optimization puzzle, you'll have to invest your resources wisely to get the best score you can! There is no clear, best path, and you only get 10 turns before the end!"},
        { "type": "center-img", "value": "images/projects/the-goddesses/turn-start.png" },
        { "type": "header", "value": "Context" },
        { "type": "text",   "value": "This game was developed over the course of 3 months as part of a school year final project. We were a team of 4 students and had to develop a game offering a complete experience within 10 to 15min.<br/>Our team was composed of a 3d artist, a sound designer, a game designer and a programmer, me." },
        { "type": "header", "value": "A game about resources" },
        { "type": "text", "value": "In The Goddesses are Gone, the player start the game with a board representing the cave where the story take place. At first, the city is composed of only one building occupying one of the cells. The player starts with 3 cards in hand, each representing a building he/she can place on the board in exchange of spending the card and paying a certain amount of a given resource. When a card is used, a new one is drawn so the player always have 3 cards available." },
        { "type": "text", "value": "Cards can come with an effect when played, like rewarding the player with other resources depending of where the building was placed." },
        { "type": "text", "value": "Each turn the player can place a single building then the turn goes through 3 additional phases, each allowing to spend his/her resources a certain way. Implications, restrictions and benefits vary from phase to phase and it is up to the player to understand them in order to take smart decisions according to his/her strategy as well as the cards he/she is given or the place and surroundings where the city is located." },
        { "type": "header", "value": "A game about data" },
        { "type": "left-img", "value": "images/projects/the-goddesses/resources.jpg" },
        { "type": "text", "value": "The spice of The Goddesses are Gone is all about managing your small economy and find the best moment to invest your various pieces of resource to reap the most profits out of it. The game offers multiples kinds of resources and various ways of using them, it is both a puzzle for the player to know what are the better choices as it was for me and my game designer to establish a good logic & structure to both handle to resources and make it easy to tweak and modify over the iterations of the production." },
        { "type": "cleaner" },
        { "type": "text", "value": "For the most part I worked on making the whole resource-related logics as abstract as possible. I took advantage of serialized data assets provided by Unity, known as Scriptable Objects. What I came up with is a system that handle each type of resource, card, bonus, etc, with an associated scriptable object containing every piece of information related to it (for the spendable resources it can be its name, icons, color scheme, category, effect)." },
        { "type": "center-img", "value": "images/projects/the-goddesses/simplified-hierarchy.png" },
        { "type": "text", "value": "In the end, this system is made up of many scriptable objects referencing and accessing one another. Yet it was made with a defined hierarchy in mind, in order to avoid inter-dependancy & cyclic dependancy that would make the code base very messy."},
        { "type": "text", "value": "As I developed this data-asset -centric architecture, I also make a scriptable object event system. It allows the whole communication between system to be easily visible & manipulable from the game editor as each event is actually a data asset. This event objects act as communication buses in the form of data assets. It ended up being really usefull, especially for my game designer and sound designer that could then have a clear view of the entierity of the available event. It helped us a lot integrating the audio system and various visual feedbacks that came up late in the development." },
        { "type": "center-img", "value": "images/projects/the-goddesses/event-channels.jpg" },
        { "type": "header", "value": "Tools and custom inspectors"},
        { "type": "text", "value": "Unity provides some features to customize its interface and create some tools or enhanced interfaces. One of my goals was to make the tweaking of the possible investments in the different phases, as easy as possible both for me and for my game designer. Each turn it is possible for the player to invest resources in development tracks, where each additional investment rewards the player with gradually better bonuses. One of the tools I made for example was a custom editor for these tracks, where the game designer can edit each slot of the track, add, remove and move them. It is also possible to tweak some properties of the tracks like their unlock conditions." },
        { "type": "banner", "value": "images/projects/the-goddesses/track-editor.gif" }
    ]
}